Repository: NickDemshin/cs2-nade-guide-flutter
Catalog: lib/l10n/app_*.arb
Languages: ru

# homeTitle
source: CS2 Grenade Guides
ru: Гайды по гранатам — CS2

source: Refresh
ru: Обновить

# errorLoading
source: Failed to load: {error}
ru: Ошибка загрузки: {error}

# noMaps
source: No maps yet
ru: Пока нет карт

source: Retry
ru: Повторить

# nadesForMapTitle
source: Nades — {map}
ru: Гранаты — {map}

# showOnlyFavorites
source: Only favorites
ru: Только избранные

source: Show all
ru: Показать все

source: Show grid
ru: Показать сетку

source: Hide grid
ru: Скрыть сетку

source: Reset zoom
ru: Сбросить зум

source: Coordinates: on
ru: Координаты: вкл

source: Coordinates: off
ru: Координаты: выкл

source: Copied: {coords}
ru: Координаты скопированы: {coords}

# colorBlindPalette
source: Colorblind-friendly colors
ru: Цвета для дальтоников

# filterAll
source: All
ru: Все

source: Side: All
ru: Сторона: Все

# selectHint
source: Tap a point to see where to throw
ru: Нажмите на точку на карте, чтобы посмотреть откуда бросать

# coordModeHint
source: Long-press to copy coordinates (0..1)
ru: Долгий тап по карте — скопировать координаты (0..1)

# typeSmoke
source: Smoke
ru: Дым

# typeFlash
source: Flash
ru: Флеш

# typeMolotov
source: Molotov
ru: Молотов

# typeHE
source: HE
ru: Осколочная

# sideLabel
source: Side: {side}
ru: Сторона: {side}

# techniqueLabel
source: Technique: {technique}
ru: Техника: {technique}

source: Details
ru: Подробнее

source: Open video
ru: Открыть видео

# openVideoFailed
source: Could not open link
ru: Не удалось открыть ссылку

# openVideoError
source: Error opening link
ru: Ошибка при открытии ссылки

# nadeCount
source: ID: {id} • Nades: {count}
ru: ID: {id} • Гранат: {count}

# searchMapsHint
source: Search maps...
ru: Поиск карт...

# toggleGrid
source: Grid view
ru: Сетка

# toggleList
source: List view
ru: Список

# noResults
source: Nothing found
ru: Ничего не найдено

# mapsTitle
source: Maps
ru: Карты

# langRussian
source: Russian
ru: Русский

# langEnglish
source: English
ru: Английский

# tabsTournament
source: Tournament
ru: Турнирные

# tabsOthers
source: Others
ru: Остальные

# tabsFavorites
source: Favorites
ru: Избранные

# languageTooltip
source: Language
ru: Язык

# addNade
source: Add grenade
ru: Добавить гранату

source: Edit
ru: Редактировать

source: Delete
ru: Удалить

# newNadeTitle
source: New grenade
ru: Новая граната

# editNadeTitle
source: Edit grenade
ru: Редактировать гранату

# fieldTitle
source: Title
ru: Название

# fieldType
source: Type
ru: Тип

# fieldSide
source: Side
ru: Сторона

# fieldFrom
source: Throw from (text)
ru: Откуда бросать (текст)

# fieldTo
source: Lands at (text)
ru: Куда прилетает (текст)

# fieldToCoords
source: Landing coords
ru: Коорд. приземления

# fieldFromCoords
source: Throw coords
ru: Коорд. броска

source: Pick on map
ru: Выбрать на карте

# fieldTechnique
source: Technique (stand/run/jumpthrow...)
ru: Техника (stand/run/jumpthrow...)

# fieldVideoUrl
source: Video URL (optional)
ru: Видео URL (необязательно)

# fieldDescription
source: Description (optional)
ru: Описание (необязательно)

source: Save
ru: Сохранить

# infoFrom
source: Throw from: {from}
ru: Откуда бросать: {from}

# infoTo
source: Lands at: {to}
ru: Куда прилетает: {to}

# fromTo
source: From: {from} → To: {to}
ru: От: {from} → К: {to}

# matchesTitle
source: Matches
ru: Матчи

# importAction
source: Import
ru: Импорт

# invalidShareCode
source: Invalid share code: {error}
ru: Неверный share code: {error}

# deleteMatchQuestion
source: Delete match?
ru: Удалить матч?

# irreversible
source: This action cannot be undone.
ru: Действие нельзя отменить.

source: Cancel
ru: Отмена

# matchAnalysisTitle
source: Match Analysis
ru: Анализ матча

source: Status
ru: Статус

source: Match deleted
ru: Матч удалён

# nadeDeleted
source: Deleted: {title}
ru: Удалено: {title}

# deleteError
source: Delete error: {error}
ru: Ошибка удаления: {error}

# analysisInsights
source: Insights
ru: Инсайты

# analysisSummary
source: Summary
ru: Сводка

# analysisThrows
source: Throws
ru: Гранаты

# analysisUtility
source: Utility
ru: Утилити

# analysisRounds
source: Rounds
ru: Раунды

# filterType
source: Type
ru: Тип

# filterRound
source: Round
ru: Раунд

# filterOnlyIneffective
source: Only ineffective
ru: Только неэффективные

# chartsTable
source: Table
ru: Таблица

# chartsGraphs
source: Charts
ru: Графики

# chartDamageByRound
source: Damage by round
ru: Урон по раундам

# chartBlindByRound
source: Blind (ms) by round
ru: Ослепление (мс) по раундам

# chartImpactByRound
source: Impact by round
ru: Импакт по раундам

# chartThrowsByType
source: Throws by type
ru: Броски по типам

# chartHeatmap
source: Heatmap
ru: Теплокарта

# heatmapNoPoints
source: No coordinates for heatmap
ru: Нет координат для теплокарты

# heatmapNoMap
source: Map is not specified
ru: Карта не указана

# heatmapNoImage
source: No background image for the map
ru: Нет фонового изображения карты

# kpiTeamFlashRatio
source: Team flash ratio: {percent}%
ru: Доля тим‑флэшей: {percent}%

# kpiSmokeLOS
source: Smoke LoS: {seconds}s
ru: Smoke LoS: {seconds}с

# kpiHeDmg
source: HE dmg: {damage}
ru: Урон HE: {damage}

# badgeIneffective
source: Ineffective: {percent}%
ru: Неэффективных: {percent}%

# insightsHighTeamFlashError
source: Too many team flashes (≥{percent}%)
ru: Слишком много тим‑флэшей (≥{percent}%)

# insightsHighTeamFlashWarn
source: Elevated team flashes (≥{percent}%)
ru: Повышенный уровень тим‑флэшей (≥{percent}%)

# insightsSmokesLowLOSWarn
source: Low smoke effectiveness (LOS < {seconds}s)
ru: Низкая эффективность смоков (LOS < {seconds}с)

# insightsSmokesShortLOSInfo
source: Short smoke line-of-sight block (LOS < {seconds}s)
ru: Короткое перекрытие линий смоками (LOS < {seconds}с)

# insightsMolotovLowImpactWarn
source: Molotovs with almost no impact
ru: Молотовы почти без влияния

# insightsHeLowAvgInfo
source: Low average HE damage (<{damage})
ru: Низкий средний урон от HE (<{damage})

# insightsIneffectiveTypeWarn
source: Many ineffective {type} (≥{percent}%)
ru: Много неэффективных {type} (≥{percent}%)

# insightsCriticalRoundsWarn
source: Critical rounds (team-flash): {rounds}
ru: Критические раунды (тим‑флэш): {rounds}
